kass/kass.org
* ref
Aslam Kassimali - Matrix analysis of structures
H.B. Harrison - Strutural analysis and design
Mosley,Spencer - Microcomputer appplications in structural engineering
Hulse, Mosley, Bungey - Reinforced concrete design by computer
* TODO tests
** IN-PROGRESS calc np tests
 - [X] KFacMos - calc stiffness and distribution factors
 - [X] TestNpBm - non prismatic beam calc
 - [X] TestNpFrm - non prismatic frame calc

** IN-PROGRESS calc tests
 - [X] beamsfbm_test - beam bm/sf funcs (hulse)
 - [X] Trs2d - 2d truss (chapter 3/4, kassimali)
 - [X] Trs2dJsd - 2d truss (chapter 3/4, kassimali)
 - [X] Bm1d - 1d beam (chapter 5, kassimali)
 - [X] BmJsd - joint support displacements calc (chapter 7, kassimali)
 - [X] Frm2d - 2d frame (chapter 6, kassimali)
 - [X] Frm2dJsd - 2d frame support disp./member releases (chapter 7, kassimali)
 - [X] Grd3d - 3d grid analysis (chapter 8, kassimali)
 - [X] Frm3d - 3d frame (chapter 8, kassimali)
 - [X] Trs3d - 3d truss (chapter 8, kassimali)
 - [X] add ons - chapter 7, kassimali examples (member releases, temp changes etc)
 - [X] NlCalcTrs2d - chapter 10 - special topics (non linear truss analysis) (kassimali)
 - [X] boltss - bolt group analysis (harrison)
 - [X] weldss - weld group analysis (harrison)
 - [ ] CalcEp - elastic - plastic analysis (harrison)
   close the deflection bit (read)
 - [ ] Calcable - cable analysis (harrison)
       nothing has been written wtf
 - [ ] EffLen - iterative column effective length calcs (harrison)
   finish ze test
** IN-PROGRESS plot tests
- [ ] general 2d line plots w/forces
  figure out forcescale
- [ ] bending moment/deflection with line plots
  again, a matter of frcscale (moment)
  deflection scale too
  
** IN-PROGRESS section tests
- [ ] SecProp calc - mosley general section properties calculation
- [ ] SecGen - 22 sections so far
- [ ] Sec3d - HUH? HUH?

** IN-PROGRESS gen tests
- [ ] GenFrm3dRcc
  it is break
- [ ] frmgen2d
- [ ] truss gen funcs
  it is break
- [ ] portal gen funcs
- [ ] load gen funcs
** IN-PROGRESS vib tests
- [ ] vibtrs - weaver truss mode analysis (LMAO)
