kass/kass.md

# Table of Contents

1.  [ref](#orgf0cbbb1)
2.  [tests](#org430b393)
    1.  [calc np tests](#org86c3442)
    2.  [calc tests](#org727d411)
    3.  [plot tests](#org60bf48a)
    4.  [section tests](#org0249327)
    5.  [gen tests](#orga235c3e)
    6.  [vib tests](#orgd423d7a)


<a id="orgf0cbbb1"></a>

# ref

Aslam Kassimali - Matrix analysis of structures
H.B. Harrison - Strutural analysis and design
Mosley,Spencer - Microcomputer appplications in structural engineering
Hulse, Mosley, Bungey - Reinforced concrete design by computer


<a id="org430b393"></a>

# TODO tests


<a id="org86c3442"></a>

## IN-PROGRESS calc np tests

-   [X] KFacMos - calc stiffness and distribution factors
-   [X] TestNpBm - non prismatic beam calc
-   [X] TestNpFrm - non prismatic frame calc


<a id="org727d411"></a>

## IN-PROGRESS calc tests

-   [X] beamsfbm<sub>test</sub> - beam bm/sf funcs (hulse)
-   [X] Trs2d - 2d truss (chapter 3/4, kassimali)
-   [X] Trs2dJsd - 2d truss (chapter 3/4, kassimali)
-   [X] Bm1d - 1d beam (chapter 5, kassimali)
-   [X] BmJsd - joint support displacements calc (chapter 7, kassimali)
-   [X] Frm2d - 2d frame (chapter 6, kassimali)
-   [X] Frm2dJsd - 2d frame support disp./member releases (chapter 7, kassimali)
-   [X] Grd3d - 3d grid analysis (chapter 8, kassimali)
-   [X] Frm3d - 3d frame (chapter 8, kassimali)
-   [X] Trs3d - 3d truss (chapter 8, kassimali)
-   [X] add ons - chapter 7, kassimali examples (member releases, temp changes etc)
-   [X] NlCalcTrs2d - chapter 10 - special topics (non linear truss analysis) (kassimali)
-   [X] boltss - bolt group analysis (harrison)
-   [X] weldss - weld group analysis (harrison)
-   [ ] CalcEp - elastic - plastic analysis (harrison)
    close the deflection bit (read)
-   [ ] Calcable - cable analysis (harrison)
    nothing has been written wtf
-   [ ] EffLen - iterative column effective length calcs (harrison)
    finish ze test


<a id="org60bf48a"></a>

## IN-PROGRESS plot tests

-   [ ] general 2d line plots w/forces
    figure out forcescale
-   [ ] bending moment/deflection with line plots
    again, a matter of frcscale (moment)
    deflection scale too


<a id="org0249327"></a>

## IN-PROGRESS section tests

-   [ ] SecProp calc - mosley general section properties calculation
-   [ ] SecGen - 22 sections so far
-   [ ] Sec3d - HUH? HUH?


<a id="orga235c3e"></a>

## IN-PROGRESS gen tests

-   [ ] GenFrm3dRcc
    it is break
-   [ ] frmgen2d
-   [ ] truss gen funcs
    it is break
-   [ ] portal gen funcs
-   [ ] load gen funcs


<a id="orgd423d7a"></a>

## IN-PROGRESS vib tests

-   [ ] vibtrs - weaver truss mode analysis (LMAO)

